In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
dframe = DataFrame({'K1':['X','X','Y','Y','Z'],
                    'K2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})
dframe

  K1     K2  dataset1  dataset2
0  X  alpha  1.384803  0.571121
1  X   beta  1.117408 -1.237744
2  Y  alpha  0.884945  0.890255
3  Y   beta -2.140222  0.980542
4  Z  alpha -2.024828 -0.595553

In [4]:
group1 = dframe['dataset1'].groupby(dframe['K1'])
group1

In [5]:
group1.mean()

K1
X    1.251106
Y   -0.627639
Z   -2.024828
Name: dataset1, dtype: float64

In [7]:
cities = np.array(['NY','LA','LA','NY','NY'])

month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [8]:
# line up dataset1 with cities and months
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB    1.117408
    JAN    0.884945
NY  FEB   -2.140222
    JAN   -0.320012
Name: dataset1, dtype: float64

In [10]:
# since grouping the data frame by K1,we see X,Y,Z on the data frame.

dframe.groupby('K1').mean()

    dataset1  dataset2
K1
X   1.251106 -0.333311
Y  -0.627639  0.935399
Z  -2.024828 -0.595553

In [11]:
# it's possible to group by multiple rows
dframe.groupby(['K1','K2']).mean()

          dataset1  dataset2
K1 K2
X  alpha  1.384803  0.571121
   beta   1.117408 -1.237744
Y  alpha  0.884945  0.890255
   beta  -2.140222  0.980542
Z  alpha -2.024828 -0.595553

In [12]:
# pretty much count how many same values in one kind of data
dframe.groupby(['K1']).size()

K1
X    2
Y    2
Z    1
dtype: int64

In [13]:
# you can also count this way
dframe.groupby(['K1']).count()

    K2  dataset1  dataset2
K1
X    2         2         2
Y    2         2         2
Z    1         1         1

In [23]:
for name, group in dframe.groupby('K1'):
    print ('This is the '+ name + ' group')
    print (group)
    print('\n')

This is the X group
  K1     K2  dataset1  dataset2
0  X  alpha  1.384803  0.571121
1  X   beta  1.117408 -1.237744


This is the Y group
  K1     K2  dataset1  dataset2
2  Y  alpha  0.884945  0.890255
3  Y   beta -2.140222  0.980542


This is the Z group
  K1     K2  dataset1  dataset2
4  Z  alpha -2.024828 -0.595553

In [28]:
for (k1,k2), group in dframe.groupby(['K1','K2']):
    print(f'Key1 = {k1}  Key 2 = {k2}')
    print ('group')
    print ('\n')

Key1 = X  Key 2 = alpha
group


Key1 = X  Key 2 = beta
group


Key1 = Y  Key 2 = alpha
group


Key1 = Y  Key 2 = beta
group


Key1 = Z  Key 2 = alpha
group

In [29]:
group_dict = dict(list(dframe.groupby('K1')))
group_dict

{'X':   K1     K2  dataset1  dataset2
 0  X  alpha  1.384803  0.571121
 1  X   beta  1.117408 -1.237744,
 'Y':   K1     K2  dataset1  dataset2
 2  Y  alpha  0.884945  0.890255
 3  Y   beta -2.140222  0.980542,
 'Z':   K1     K2  dataset1  dataset2
 4  Z  alpha -2.024828 -0.595553}

In [30]:
group_dict['X']

  K1     K2  dataset1  dataset2
0  X  alpha  1.384803  0.571121
1  X   beta  1.117408 -1.237744

In [31]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis = 1)))

In [32]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  1.384803  0.571121
 1  1.117408 -1.237744
 2  0.884945  0.890255
 3 -2.140222  0.980542
 4 -2.024828 -0.595553,
 dtype('O'):   K1     K2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [33]:
# find the mean values for dataset2 
dataset2_group = dframe.groupby(['K1','K2'])[['dataset2']]
dataset2_group.mean()

          dataset2
K1 K2
X  alpha  0.571121
   beta  -1.237744
Y  alpha  0.890255
   beta   0.980542
Z  alpha -0.595553